tutorials/plastic_cases/surface_deformation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 1
);

regions
( 

    boxToCell 
    {
        box (0 0.2 -1) (0.5 0.3 1);
        fieldValues
        (
            volScalarFieldValue epss 0	
        );
    }

    rotatedBoxToCell
    {
    //    box (0.248 0.002 -1) (0.2525 0.006 1);
    //   box (0 0 0) (1 1 1);
        origin (0.25 -0.05  0);
        i (0.007 0.007 -0.007);
        j (-0.007 0.007 -0.007);
        k (0 0.2 0.1);  //make 0.2 bigger for more pointy
        fieldValues
        (
            volScalarFieldValue epss 0
            volScalarFieldValue alpha.wetting 0
        );
   }
);
// ************************************************************************* //
